content-org/all-posts.org
#+hugo_base_dir: ../
#+macro: abbr @@html:<abbr title="$2">$1</abbr>@@
#+macro: dfn @@html:<dfn>$1</dfn>@@
#+macro: var @@html:<var>$1</var>@@
#+macro: q @@html:<q cite="$1">$2</q>@@
#+macro: person @@html:<span class="person p-name">$1</span>@@
#+macro: lang @@html:<span class="language">$1</span>@@

** DONE ME
CLOSED: [2023-10-09 Mon 16:43]
:PROPERTIES:
:EXPORT_FILE_NAME: me
:END:
In this vast world, teeming with approximately 8 billion human beings, I, too, find myself among their ranks, a singular entity in the tapestry of humanity.

Through my intellectual journey, I have delved into the realms of architecture and cognitive science, exploring the intricate connections between our built environment and the workings of the human mind. However, amidst this exploration, my fascination with computing remained unwavering, beckoning me towards a path where I finally discovered my true calling as a developer.

*** Name-wise
You can call me @@html:<span class="person p-nickname">Perma</span>@@. My legal name is @@html:<span class="person p-name p-given-name">AmirHossein Alesheikh</span>@@. I don't mind either, but I prefer @@html:<span class="person p-nickname">Perma</span>@@. Read [[../../posts/call-me-perma][Call Me Perma]] for more information.

You can use any pronouns, I don't mind any of them, I don't identify with any of genders, anyways. But it will be nice if you could make it clear to me which one you have chosen.

*** Job-wise
As a back-end developer, my expertise lies in utilizing languages like {{{lang(Go)}}} and {{{lang(Rust)}}} to build the foundational components of software systems.

I predominantly focus on developing the back-end of back-ends, ensuring the smooth functioning and interconnectivity of various subsystems.

Additionally, I also engage in system programming, working with low-level components and infrastructure to ensure optimal performance and reliability.

*** Tech-wise
Since the tender age of 5, my eyes have been fixated on computer screens, even during those moments when they lay dormant. The hours I've devoted to sitting behind desktop computers far exceed the time I've dedicated to restful slumber. Throughout my life, I proudly embrace the label of a /bona fide/ textbook nerd, finding immense joy and fascination in the pages of educational literature. In fact, my favorite genre of books happens to be none other than textbooks themselves.

*** Advocacy
For over 15 years, I have actively engaged in the realm of free software advocacy, passionately advocating for the principles of openness and accessibility. It's safe to say that I find myself firmly planted in the far-left corner of political stereotypes, unapologetically embracing a feminist perspective, advocating for veganism and animal rights, and actively participating in environmentalism. While there are other aspects of my beliefs, such as my alignment with [[https://www.lesswrong.com/tag/rationalist-movement][rationalism]], utilitarianism, and consciousness idealism, I won't delve into those topics and burden you with excessive details.

*** Me, in the wild
- [[https:fosstodon.org/@prma][Fosstodon]]
- [[https:codeberg.org/prma][Codeberg]]
- [[https:github.com/prmadev][GitHub]]
- [[https:linkedin.com/in/prmadev][Linkedin]]

*** FAQ
- What time is it?
- What's your dogs name?
- Is your dog friendly?
- Is it your turn to cook lunch or mine?

Yeah, I hear these questions quit frequently!
